In [1]:
#DataFrame

In [5]:
import pandas as pd
i=[1,2,3,4,5,6]
var = pd.DataFrame(i)
print(var)
print(type(var))

   0
0  1
1  2
2  3
3  4
4  5
5  6
<class 'pandas.core.frame.DataFrame'>

In [19]:
d={"name":["vanshuk","rohit","john","django"],"class":[12,1,14,15]}
var1 = pd.DataFrame(d)
var1

      name  class
0  vanshuk     12
1    rohit      1
2     john     14
3   django     15

In [21]:
d={"name":["vanshuk","rohit","john","django"],"class":[12,1,14,15]}
var1 = pd.DataFrame(d,columns=["name"])
var1

      name
0  vanshuk
1    rohit
2     john
3   django

In [27]:
d={"name":["vanshuk","rohit","john","django"],"class":[12,1,14,15],1:[241232,4231,1312,3424]}
var1 = pd.DataFrame(d,columns=["name",1])
var1

      name       1
0  vanshuk  241232
1    rohit    4231
2     john    1312
3   django    3424

In [29]:
d={"name":["vanshuk","rohit","john","django"],"class":[12,1,14,15]}
var1 = pd.DataFrame(d,index=["a","b","c","d"])
var1

      name  class
a  vanshuk     12
b    rohit      1
c     john     14
d   django     15

In [33]:
d={"name":["vanshuk","rohit","john","django"],"class":[12,1,14,15]}
var1 = pd.DataFrame(d)
print(var1)
print(var1["name"][2])

      name  class
0  vanshuk     12
1    rohit      1
2     john     14
3   django     15
john

In [35]:
list_1=[[1,2,3,4,5],[6,7,8,9,10]]
var2 = pd.DataFrame(list_1)
print(var2)

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [45]:
sr = {"s":pd.Series([1,2,3,4]),"r":pd.Series([1,2,3,4])}
var3 = pd.DataFrame(sr)
print(var3)

   s  r
0  1  1
1  2  2
2  3  3
3  4  4